package com.aide.codemodel.language.xml;

import abcd.cy;
import abcd.dy;
import abcd.ey;
import abcd.fy;
import abcd.gy;
import abcd.iy;
import com.aide.codemodel.api.Lexer;
import java.io.Reader;

@cy(clazz = 734884329284778900L, container = 734884329284778900L, user = true)
/* loaded from: classes.dex */
public class XmlLexer implements Lexer {

    @dy(field = 3741796366352850655L)
    private static final int[] Mr;

    @dy(field = 947782806335609275L)
    private static final int[] U2;

    @dy(field = -4678941252915561395L)
    private static final String[] a8;

    @dy(field = -2256379531712545440L)
    private static final char[] aM;

    @gy
    private static /* synthetic */ boolean er;

    @dy(field = -1065337212141383965L)
    private static final int[] j3;

    @dy(field = 2307776365576801531L)
    private static final int[] lg;

    @fy
    private static /* synthetic */ boolean rN;

    @dy(field = 1483997069826704067L)
    private int DW;

    @dy(field = 610797461686438125L)
    private boolean EQ;

    @dy(field = -861224760316513125L)
    private int FH;

    @dy(field = -963351154763628020L)
    private char[] Hw;

    @dy(field = -2243270335076591184L)
    private boolean J0;

    @dy(field = 1366489209965961672L)
    private boolean J8;

    @dy(field = 2785406421574754705L)
    private int QX;

    @dy(field = 803982953670803527L)
    private int VH;

    @dy(field = 648580631863874696L)
    private boolean Ws;

    @dy(field = 4536021103583144333L)
    private int XL;

    @dy(field = -722463693237499741L)
    private int Zo;

    @dy(field = 3596082154469282736L)
    private int gn;

    @dy(field = 576772927738075425L)
    private Reader j6;

    @dy(field = 1438999862611900512L)
    private int tp;

    @dy(field = -788086346459989551L)
    private int u7;

    @dy(field = -33086302755638352L)
    private int v5;

    @dy(field = 3595867126778882205L)
    private boolean we;

    static {
        try {
            iy.Zo(XmlLexer.class);
            if (rN) {
                iy.gn(698132834179647537L, null);
            }
            aM = QX("\t\u0000\u0001\u0001\u0001\u0001\u0002\u0000\u0001\u0001\u0012\u0000\u0001\u0001\u0001\u0011\u0001!\u0001\t\u0002\u0000\u0001\b\u0001\"\u0005\u0000\u0001\u0006\u0001\u0004\u0001\u001b\n\u0005\u0001\u0007\u0001\n\u0001\r\u0001%\u0001\u001c\u0001\u000e\u0001\u0000\u0001\u0015\u0001\u001f\u0001\u0013\u0001\u0014\u0001\u001a\u0001\f\u0002\u0002\u0001 \u0002\u0002\u0001\u0010\u0001\u000f\u0001\u0002\u0001\u0017\u0001\u0019\u0001\u0002\u0001$\u0001\u001d\u0001\u0016\u0001\u001e\u0002\u0002\u0001\u000b\u0001\u0018\u0001\u0002\u0001\u0012\u0001\u0000\u0001#\u0001\u0000\u0001\u0003\u0001\u0000\u0001\u0015\u0001\u001f\u0001\u0013\u0001\u0014\u0001\u001a\u0001\f\u0002\u0002\u0001 \u0002\u0002\u0001\u0010\u0001\u000f\u0001\u0002\u0001\u0017\u0001\u0019\u0001\u0002\u0001$\u0001\u001d\u0001\u0016\u0001\u001e\u0002\u0002\u0001\u000b\u0001\u0018\u0001\u0002<\u0000\u0001\u0004\b\u0000\u0017\u0003\u0001\u0000\u001f\u0003\u0001\u0000\b\u00032\u0003\u0002\u0000\u000b\u0003\u0002\u0000\b\u0003\u0001\u00005\u0003\u0001\u0000D\u0003\t\u0000$\u0003\u0003\u0000\u0002\u0003\u0004\u0000\u001e\u00038\u0000Y\u0003\u0012\u0000\u0007\u0003\u000e\u0000\u0001\u0004\u0001\u0004.\u0000F\u0004\u001a\u0000\u0002\u0004$\u0000\u0001\u0003\u0001\u0004\u0003\u0003\u0001\u0000\u0001\u0003\u0001\u0000\u000b\u0003\u0001\u0003\b\u0003\u0001\u0000\t\u0003\u0001\u0003\u001c\u0003\u0001\u0003\u0002\u0003\u0001\u0003\u0002\u0003\u0001\u0000\u0007\u0003\u0003\u0000\u0002\u0003\u0002\u0003\u0002\u0003\u0002\u0003\u0012\u0003\r\u0000\f\u0003\u0001\u0000B\u0003\u0001\u0000\f\u0003\u0001\u0000$\u0003\u0001\u0000\u0004\u0004\t\u00005\u0003\u0002\u0000\u0002\u0003\u0002\u0000\u0002\u0003\u0003\u0000\u001c\u0003\u0002\u0000\b\u0003\u0002\u0000\u0002\u00037\u0000&\u0003\u0002\u0000\u0001\u0003\u0007\u0000&\u0003\n\u0000\u0011\u0004\u0001\u0000\u0017\u0004\u0001\u0000\u0003\u0004\u0001\u0000\u0001\u0004\u0001\u0000\u0002\u0004\u0001\u0000\u0001\u0004\u000b\u0000\u001b\u0003\u0005\u0000\u0003\u0003.\u0000\u001a\u0003\u0005\u0000\u0001\u0004\n\u0003\b\u0004\r\u0000\n\u0004\u0006\u0000\u0001\u0004G\u0003\u0002\u0000\u0005\u0003\u0001\u0000\u000f\u0003\u0001\u0000\u0004\u0003\u0001\u0000\u0001\u0003\u0007\u0004\u0003\u0004\u0005\u0004\u0002\u0003\u0002\u0004\u0001\u0000\u0004\u0004\u0002\u0000\n\u0004ȇ\u0000\u0003\u0004\u0001\u00005\u0003\u0002\u0000\u0001\u0004\u0001\u0003\u000f\u0004\u0001\u0004\u0003\u0000\u0004\u0004\u0003\u0000\n\u0003\u0002\u0004\u0002\u0000\n\u0004\u0011\u0000\u0003\u0004\u0001\u0000\b\u0003\u0002\u0000\u0002\u0003\u0002\u0000\u0016\u0003\u0001\u0000\u0007\u0003\u0001\u0000\u0001\u0003\u0003\u0000\u0004\u0003\u0002\u0000\u0001\u0004\u0001\u0000\u0001\u0004\u0001\u0004\u0005\u0004\u0002\u0000\u0002\u0004\u0002\u0000\u0003\u0004\t\u0000\u0001\u0004\u0004\u0000\u0002\u0003\u0001\u0000\u0003\u0003\u0002\u0004\u0002\u0000\n\u0004\u0002\u0003\u0010\u0000\u0001\u0004\u0002\u0000\u0006\u0003\u0004\u0000\u0002\u0003\u0002\u0000\u0016\u0003\u0001\u0000\u0007\u0003\u0001\u0000\u0002\u0003\u0001\u0000\u0002\u0003\u0001\u0000\u0002\u0003\u0002\u0000\u0001\u0004\u0001\u0000\u0001\u0004\u0001\u0004\u0003\u0004\u0004\u0000\u0002\u0004\u0002\u0000\u0003\u0004\u000b\u0000\u0004\u0003\u0001\u0000\u0001\u0003\u0007\u0000\n\u0004\u0002\u0004\u0003\u0003\f\u0000\u0003\u0004\u0001\u0000\u0007\u0003\u0001\u0000\u0001\u0003\u0001\u0000\u0003\u0003\u0001\u0000\u0016\u0003\u0001\u0000\u0007\u0003\u0001\u0000\u0002\u0003\u0001\u0000\u0005\u0003\u0002\u0000\u0001\u0004\u0001\u0003\b\u0004\u0001\u0000\u0003\u0004\u0001\u0000\u0003\u0004\u0012\u0000\u0001\u0003\u0005\u0000\n\u0004\u0011\u0000\u0003\u0004\u0001\u0000\b\u0003\u0002\u0000\u0002\u0003\u0002\u0000\u0016\u0003\u0001\u0000\u0007\u0003\u0001\u0000\u0002\u0003\u0002\u0000\u0004\u0003\u0002\u0000\u0001\u0004\u0001\u0003\u0006\u0004\u0003\u0000\u0002\u0004\u0002\u0000\u0003\u0004\b\u0000\u0002\u0004\u0004\u0000\u0002\u0003\u0001\u0000\u0003\u0003\u0004\u0000\n\u0004\u0012\u0000\u0002\u0004\u0001\u0000\u0006\u0003\u0003\u0000\u0003\u0003\u0001\u0000\u0004\u0003\u0003\u0000\u0002\u0003\u0001\u0000\u0001\u0003\u0001\u0000\u0002\u0003\u0003\u0000\u0002\u0003\u0003\u0000\u0003\u0003\u0003\u0000\b\u0003\u0001\u0000\u0003\u0003\u0004\u0000\u0005\u0004\u0003\u0000\u0003\u0004\u0001\u0000\u0004\u0004\t\u0000\u0001\u0004\u000f\u0000\t\u0004\u0011\u0000\u0003\u0004\u0001\u0000\b\u0003\u0001\u0000\u0003\u0003\u0001\u0000\u0017\u0003\u0001\u0000\n\u0003\u0001\u0000\u0005\u0003\u0004\u0000\u0007\u0004\u0001\u0000\u0003\u0004\u0001\u0000\u0004\u0004\u0007\u0000\u0002\u0004\t\u0000\u0002\u0003\u0004\u0000\n\u0004\u0012\u0000\u0002\u0004\u0001\u0000\b\u0003\u0001\u0000\u0003\u0003\u0001\u0000\u0017\u0003\u0001\u0000\n\u0003\u0001\u0000\u0005\u0003\u0004\u0000\u0007\u0004\u0001\u0000\u0003\u0004\u0001\u0000\u0004\u0004\u0007\u0000\u0002\u0004\u0007\u0000\u0001\u0003\u0001\u0000\u0002\u0003\u0004\u0000\n\u0004\u0012\u0000\u0002\u0004\u0001\u0000\b\u0003\u0001\u0000\u0003\u0003\u0001\u0000\u0017\u0003\u0001\u0000\u0010\u0003\u0004\u0000\u0006\u0004\u0002\u0000\u0003\u0004\u0001\u0000\u0004\u0004\t\u0000\u0001\u0004\b\u0000\u0002\u0003\u0004\u0000\n\u0004\u0091\u0000.\u0003\u0001\u0000\u0001\u0003\u0001\u0004\u0002\u0003\u0007\u0004\u0005\u0000\u0006\u0003\u0001\u0004\b\u0004\u0001\u0000\n\u0004'\u0000\u0002\u0003\u0001\u0000\u0001\u0003\u0002\u0000\u0002\u0003\u0001\u0000\u0001\u0003\u0002\u0000\u0001\u0003\u0006\u0000\u0004\u0003\u0001\u0000\u0007\u0003\u0001\u0000\u0003\u0003\u0001\u0000\u0001\u0003\u0001\u0000\u0001\u0003\u0002\u0000\u0002\u0003\u0001\u0000\u0002\u0003\u0001\u0000\u0001\u0003\u0001\u0004\u0002\u0003\u0006\u0004\u0001\u0000\u0002\u0004\u0001\u0003\u0002\u0000\u0005\u0003\u0001\u0000\u0001\u0004\u0001\u0000\u0006\u0004\u0002\u0000\n\u0004>\u0000\u0002\u0004\u0006\u0000\n\u0004\u000b\u0000\u0001\u0004\u0001\u0000\u0001\u0004\u0001\u0000\u0001\u0004\u0004\u0000\u0001\u0004\u0001\u0004\b\u0003\u0001\u0000!\u0003\u0007\u0000\u0014\u0004\u0001\u0000\u0006\u0004\u0004\u0000\u0006\u0004\u0001\u0000\u0001\u0004\u0001\u0000\u0015\u0004\u0003\u0000\u0007\u0004\u0001\u0000\u0001\u0004æ\u0000&\u0003\n\u0000'\u0003\t\u0000\u0001\u0003\u0001\u0000\u0002\u0003\u0001\u0000\u0003\u0003\u0001\u0000\u0001\u0003\u0001\u0000\u0002\u0003\u0001\u0000\u0005\u0003)\u0000\u0001\u0003\u0001\u0000\u0001\u0003\u0001\u0000\u0001\u0003\u000b\u0000\u0001\u0003\u0001\u0000\u0001\u0003\u0001\u0000\u0001\u0003\u0003\u0000\u0002\u0003\u0003\u0000\u0001\u0003\u0005\u0000\u0003\u0003\u0001\u0000\u0001\u0003\u0001\u0000\u0001\u0003\u0001\u0000\u0001\u0003\u0001\u0000\u0001\u0003\u0003\u0000\u0002\u0003\u0003\u0000\u0002\u0003\u0001\u0000\u0001\u0003(\u0000\u0001\u0003\t\u0000\u0001\u0003\u0002\u0000\u0001\u0003\u0002\u0000\u0002\u0003\u0007\u0000\u0002\u0003\u0001\u0000\u0001\u0003\u0001\u0000\u0007\u0003(\u0000\u0001\u0003\u0004\u0000\u0001\u0003\b\u0000\u0001\u0003ఆ\u0000\u009c\u0003\u0004\u0000Z\u0003\u0006\u0000\u0016\u0003\u0002\u0000\u0006\u0003\u0002\u0000&\u0003\u0002\u0000\u0006\u0003\u0002\u0000\u0001\u0003\u0001\u0003\u0001\u0003\u0001\u0003\u0001\u0003\u0001\u0003\u0002\u0003\u0001\u0000\u0001\u0003\u0001\u0000\u0001\u0003\u0001\u0000\u0001\u0003\u0001\u0000\u001f\u0003\u0002\u00005\u0003\u0001\u0000\u0007\u0003\u0001\u0000\u0001\u0003\u0003\u0000\u0003\u0003\u0001\u0000\u0007\u0003\u0003\u0000\u0004\u0003\u0002\u0000\u0006\u0003\u0004\u0000\r\u0003\u0005\u0000\u0003\u0003\u0001\u0000\u0007\u0003Ó\u0000\r\u0004\u0004\u0000\u0001\u0004D\u0000\u0001\u0003\u0003\u0000\u0002\u0003\u0002\u0000\u0001\u0003Q\u0000\u0003\u0003ຂ\u0000\u0001\u0004\u0001\u0000\u0001\u0003\u0019\u0000\t\u0003\u0006\u0004\u0001\u0000\u0005\u0004\u000b\u0000T\u0003\u0004\u0000\u0001\u0004\u0001\u0004\u0002\u0000\u0002\u0004\u0002\u0000Z\u0003\u0001\u0000\u0003\u0004\u0006\u0000(\u0003᳓\u0000冦\u0003ౚ\u0000⮤\u0003\\\u0000ࠀ\u0000῾\u0000\u0002\u0000");
            j3 = J0();
            Mr = aM();
            U2 = Mr();
            a8 = new String[]{"Unkown internal scanner error", "Error: could not match input", "Error: pushback value was too large"};
            lg = Ws();
        } catch (Throwable th) {
            if (er) {
                iy.aM(th, 698132834179647537L, null);
            }
            throw th;
        }
    }

    @ey(method = 1382717927770575861L)
    public XmlLexer(Reader reader) {
        try {
            if (rN) {
                iy.tp(-34141725855797920L, null, reader);
            }
            this.FH = 0;
            this.Hw = new char[8192];
            this.QX = -1;
            this.XL = -1;
            this.j6 = reader;
        } catch (Throwable th) {
            if (er) {
                iy.j3(th, -34141725855797920L, null, reader);
            }
            throw th;
        }
    }

    @ey(method = -2619352981663196643L)
    private void EQ(int i) {
        String str;
        try {
            if (rN) {
                iy.u7(576722745145601015L, this, i);
            }
            try {
                str = a8[i];
            } catch (ArrayIndexOutOfBoundsException unused) {
                str = a8[0];
            }
            throw new Error(str);
        } catch (Throwable th) {
            if (er) {
                iy.j3(th, 576722745145601015L, this, new Integer(i));
            }
            throw th;
        }
    }

    @ey(method = 4608655603735662771L)
    private static int[] J0() {
        try {
            if (rN) {
                iy.gn(-3016651912464909403L, null);
            }
            int[] iArr = new int[173];
            we("\t\u0000\u0001\u0001\u0003\u0000\u0001\u0002\u0001\u0003\u0001\u0004\u0001\u0005\u0001\u0006\u0002\u0007\u0001\b\u0002\t\u0001\n\u0001\u0007\u0001\u000b\u0001\t\u0001\f\u0001\r\u0001\u000e\u0001\u000f\u0002\u0010\u0001\u0005\u0001\u0011\u0001\u0012\u0001\u0013\u0001\u0014\u0001\u0015\u0001\u0005\u0001\u0016\u0001\u0007\u0001\u0017\u0001\u0007\u0001\u0017\u0001\u0018\u0001\u0017\u0002\u0007\u0001\u0019\u0001\u001a\u0001\u001b\u0001\u001c\u0002\u001d\u0001\u001e\u0001\u001f\u0001\u0001\u0001\u0007\u0001 \u0001\u0007\u0001\t\u0001!\u0001\"\u0001\u0000\u0001#\u0001\u0000\u0001$\u0004\u0000\u0001%\u0001&\u0002\t\u0001\u0000\u0001\u000f\u0001\u0000\u0001'\u0003\u0000\u0001(\u0001\u0000\u0001)\u0002\u0017\u0001\u0000\u0001*\u0002\u0000\u0001+\u0002\u0000\u0001,\t\u0000\u0001-\u0001.\u0001\u0000\u0002\t\u0001/\u0001\u0010\u0004\u0000\u0002\u0017\u0005\u0000\u00010\u0001\u0000\u00021\u00012\u0002\u0000\u00013\u0002\u0000\u00014\u0002\t\u00015\u00016\u0001\u0000\u00017\u0002\u0017\u00018\u0001\u0000\u00019\u0001\u0000\u0001:\u0002\u0000\u0001;\u0002\u0000\u0001\t\u0001<\u0002\u0017\u0004\u0000\u0001=\u0001>\u0001?\u0005\u0000\u0001$\u0002\u0000\u0001@\u0001A", 0, iArr);
            return iArr;
        } catch (Throwable th) {
            if (er) {
                iy.aM(th, -3016651912464909403L, null);
            }
            throw th;
        }
    }

    @ey(method = 3643664675745150607L)
    private static int J8(String str, int i, int[] iArr) {
        int i2;
        try {
            if (rN) {
                iy.we(3067985288887467165L, null, str, new Integer(i), iArr);
            }
            int i3 = 0;
            int length = str.length();
            int i4 = i;
            while (i3 < length) {
                int i5 = i3 + 1;
                int iCharAt = str.charAt(i3);
                int i6 = i5 + 1;
                char cCharAt = str.charAt(i5);
                while (true) {
                    i2 = i4 + 1;
                    iArr[i4] = cCharAt;
                    iCharAt--;
                    if (iCharAt <= 0) {
                        break;
                    }
                    i4 = i2;
                }
                i3 = i6;
                i4 = i2;
            }
            return i4;
        } catch (Throwable th) {
            if (er) {
                iy.U2(th, 3067985288887467165L, null, str, new Integer(i), iArr);
            }
            throw th;
        }
    }

    @ey(method = 1589812309990250551L)
    private static int[] Mr() {
        try {
            if (rN) {
                iy.gn(863745982085160625L, null);
            }
            int[] iArr = new int[4864];
            j3("\u0001\u000e\u0001\u000f\u0006\u000e\u0001\u0010\u0004\u000e\u0001\u0011\u0018\u000e#\u0012\u0001\u0013\u0002\u0012\u0001\u0014\u0001\u0015\u0002\u0016\u0003\u0014\u0001\u0017\u0003\u0014\u0002\u0016\u0001\u0018\u0001\u0014\u0002\u0016\u0002\u0014\b\u0016\u0001\u0019\u0001\u001a\u0001\u001b\u0003\u0016\u0001\u001c\u0001\u001d\u0001\u0014\u0001\u0016\u0001\u001e\u0001\u001f\u0001\u0015\u0002 \u0003\u001f\u0001!\u0003\u001f\u0002 \u0001\"\u0001\u001f\u0002 \u0002\u001f\b \u0001\u0019\u0001\u001a\u0004 \u0001\u001c\u0001\u001d\u0001\u001f\u0001 \u0001\u001e\u0001#\u0001$\u0002%\u0003#\u0001%\u0001&\u0001#\u0001'\u0002%\u0001(\u0001#\u0002%\u0002#\b%\u0002#\u0004%\u0003#\u0001%\u0001#\u000e)\u0001*\u0017)\u0001\u0014\u0001\u0015\u0002+\u0003\u0014\u0001+\u0003\u0014\u0002+\u0002\u0014\u0002+\u0001\u0014\u0001,\u0006+\u0001-\u0001+\u0001\u0014\u0001.\u0001/\u0003+\u00010\u00011\u0001\u0014\u0001+\u0001\u0014\b2\u00013\u00182\u00014\u00015\u00032\u00026\u00027\u00036\u00017\u00018\u00016\u00019\u00027\u00026\u00027\u00026\b7\u00026\u00047\u00024\u00016\u00017\u00016\u0006:\u0001;\u001f:\r<\u0001=\u0018<\u0002\u0014\u0002>\u0003\u0014\u0001?\u0003\u0014\u0002>\u0002\u0014\u0002>\u0002\u0014\b>\u0002\u0014\u0004>\u0003\u0014\u0001>\u0003\u0014\u0002@\u0003\u0014\u0001?\u0003\u0014\u0002@\u0002\u0014\u0002@\u0002\u0014\b@\u0002\u0014\u0004@\u0003\u0014\u0001@\u0001\u0014\u0001\u000e\u0001\u0000\u0006\u000e\u0001\u0000\u0004\u000e\u0001\u0000\u0018\u000e\u0001\u0000\u0001\u000f-\u0000\u0001A*\u0000\u0001B\u0002\u0000\u0001C\t\u0000\u0001D\n\u0000#\u0012\u0001E%\u0012\u0001F\u0002\u0012'\u0000\u0001\u0015&\u0000\u0005\u0016\u0001G\u0003\u0000\u0002\u0016\u0002\u0000\u0002\u0016\u0002\u0000\b\u0016\u0002\u0000\u0004\u0016\u0003\u0000\u0001\u0016\u0003\u0000\u0006\u0017\u0003\u0000\u0002\u0017\u0002\u0000\u0002\u0017\u0002\u0000\b\u0017\u0002\u0000\u0004\u0017\u0003\u0000\u0001\u0017\u0012\u0000\u0001H\t\u0000\u0001I&\u0000\u0001J\u000b\u0000\u0005\u0016\u0001G\u0003\u0000\u0002\u0016\u0002\u0000\u0002\u0016\u0002\u0000\u0001K\u0002\u0016\u0001L\u0004\u0016\u0002\u0000\u0004\u0016\u0003\u0000\u0001\u0016\u0001\u0000\u0001\u001f\u0001\u0000\u0005\u001f\u0001\u0000\u0005\u001f\u0001\u0000\r\u001f\u0002\u0000\u0004\u001f\u0002\u0000\u0002\u001f\u0001\u0000\u0001\u001f\u0001\u0000\u0005 \u0001M\u0003\u001f\u0002 \u0001\u0000\u0001\u001f\u0002 \u0002\u001f\b \u0002\u0000\u0004 \u0002\u0000\u0001\u001f\u0001 \u0001\u0000\u0001N\u0001\u0000\u0006!\u0003N\u0002!\u0001\u0000\u0001N\u0002!\u0002N\b!\u0002\u0000\u0004!\u0002\u0000\u0001N\u0001!\u0012\u0000\u0001O\t\u0000\u0001P\u000b\u0000\u0001$&\u0000\u0006%\u0003\u0000\u0002%\u0002\u0000\u0002%\u0002\u0000\b%\u0002\u0000\u0004%\u0003\u0000\u0001%\n\u0000\u0001Q-\u0000\u0001R\t\u0000\u0001D\n\u0000\u000e)\u0001S3)\u0001T\t)\u0002\u0000\u0006+\u0003\u0000\u0002+\u0002\u0000\u0002+\u0002\u0000\b+\u0002\u0000\u0004+\u0003\u0000\u0001+\u0001\u0000#U\u0001V\u0002U\u0002\u0000\u0006+\u0003\u0000\u0002+\u0002\u0000\u0002+\u0002\u0000\b+\u0002\u0000\u0001+\u0001W\u0002+\u0003\u0000\u0001+\u0003\u0000\u0006+\u0003\u0000\u0002+\u0002\u0000\u0002+\u0002\u0000\u0005+\u0001X\u0002+\u0002\u0000\u0004+\u0003\u0000\u0001+\u0001\u0000!Y\u0001Z\u0004Y\"[\u0001Z\u0003[\b2\u0001\u0000\u00182\u0002\u0000\u00032\t\u0000\u0001\\\u001e\u0000\u0006]\u0003\u0000\u0002]\u0002\u0000\u0002]\u0002\u0000\b]\u0002\u0000\u0004]\u0003\u0000\u0001]\n\u0000\u0001^\u001c\u0000\u0006:\u0001_%:\u0001`\u001f:\r<\u0001a3<\u0001b\n<\u0002\u0000\u0005>\u0004\u0000\u0002>\u0002\u0000\u0002>\u0002\u0000\b>\u0002\u0000\u0004>\u0003\u0000\u0001>\u0003\u0000\u0005@\u0004\u0000\u0002@\u0002\u0000\u0002@\u0002\u0000\b@\u0002\u0000\u0004@\u0003\u0000\u0001@\u0006\u0000\u0001c\u0005\u0000\u0001d%\u0000\u0001e \u0000\u0001f\u000b\u0000\u0001g\u0001\u0000\u0001h\u0011\u0000#\u0012\u0001i\u001e\u0012\u0001j\t\u0012\u0002\u0000\u0002k\u0004\u0017\u0003\u0000\u0002k\u0002\u0000\u0002k\u0002\u0000\bk\u0002\u0000\u0004k\u0003\u0000\u0001k\u0007\u0000\u0001l!\u0000\u0005\u0016\u0001G\u0003\u0000\u0002\u0016\u0002\u0000\u0002\u0016\u0002\u0000\b\u0016\u0002\u0000\u0004\u0016\u0003\u0000\u0001m\u0003\u0000\u0005\u0016\u0001G\u0003\u0000\u0002\u0016\u0002\u0000\u0002\u0016\u0002\u0000\u0005\u0016\u0001n\u0002\u0016\u0002\u0000\u0004\u0016\u0003\u0000\u0001\u0016\u0003\u0000\u0002o\u0004p\u0003\u0000\u0002o\u0002\u0000\u0002o\u0002\u0000\bo\u0002\u0000\u0004o\u0003\u0000\u0001o\u0001\u0000\u0001N\u0001\u0000\u000bN\u0001\u0000\rN\u0002\u0000\u0004N\u0002\u0000\u0002N\u0007\u0000\u0001q$\u0000\u0001r\u0005\u0000\u0001s \u0000\u0001t\u000b\u0000\u0001g\u0013\u0000\u001c)\u0001\u0000\t)\u0002\u0000\u0006+\u0003\u0000\u0002+\u0002\u0000\u0002+\u0002\u0000\b+\u0002\u0000\u0002+\u0001u\u0001+\u0003\u0000\u0001+\u0003\u0000\u0006+\u0003\u0000\u0002+\u0002\u0000\u0002+\u0002\u0000\b+\u0002\u0000\u0001v\u0003+\u0003\u0000\u0001+\u0006\u0000\u0001w\u0005\u0000\u0001x\u001f\u0000\u0001y\u0005\u0000\u0001z\u001a\u0000\u0006:\u0001\u0000\u001f:\u0001\u0000\u0001{\u001a\u0000\u0001|\t\u0000\u001b<\u0001}\f<\u0001~\b<\u0002~\u0002<\u0002~\u0002<\b~\u0002<\u0001\u007f\u0003~\u0003<\u0001~\u0001<\u0005\u0000\u0001c\u0004\u0000\u0001\u0080 \u0000\u0001\u0081\u0006\u0000\u0001\u0081\u0006\u0000\u0003\u0081\u0004\u0000\u0001\u0081\u0004\u0000\u0001\u0081\u0015\u0000\u0001\u0082\u001c\u0000\u0001\u00832\u0000\u0001\u0084)\u0000\u0001\u0085\u000e\u0000\u001c\u0012\u0001\u0000\t\u0012\u0006\u0000\u0001\u0086!\u0000\u0005\u0016\u0001G\u0003\u0000\u0002\u0016\u0002\u0000\u0002\u0016\u0002\u0000\b\u0016\u0002\u0000\u0003\u0016\u0001\u0087\u0003\u0000\u0001\u0016\u0003\u0000\u0005\u0016\u0001G\u0003\u0000\u0002\u0016\u0002\u0000\u0001\u0016\u0001\u0088\u0002\u0000\b\u0016\u0002\u0000\u0004\u0016\u0003\u0000\u0001\u0016\u0003\u0000\u0006p\u0003\u0000\u0002p\u0002\u0000\u0002p\u0002\u0000\bp\u0002\u0000\u0004p\u0003\u0000\u0001p\u0007\u0000\u0001\u0089$\u0000\u0001r\u0004\u0000\u0001\u008a \u0000\u0001\u008b\u0006\u0000\u0001\u008b\u0006\u0000\u0003\u008b\u0004\u0000\u0001\u008b\u0004\u0000\u0001\u008b\f\u0000\u0001\u008c!\u0000\u0006+\u0003\u0000\u0002+\u0002\u0000\u0001+\u0001\u008d\u0002\u0000\b+\u0002\u0000\u0004+\u0003\u0000\u0001+\u0003\u0000\u0006+\u0003\u0000\u0002+\u0002\u0000\u0002+\u0002\u0000\u0003+\u0001\u008e\u0004+\u0002\u0000\u0004+\u0003\u0000\u0001+\u0006\u0000\u0001w\u0004\u0000\u0001\u008f \u0000\u0001\u0090\u0006\u0000\u0001\u0090\u0006\u0000\u0003\u0090\u0004\u0000\u0001\u0090\u0004\u0000\u0001\u0090\u000b\u0000\u0001y\u0004\u0000\u0001\u0091 \u0000\u0001\u0092\u0006\u0000\u0001\u0092\u0006\u0000\u0003\u0092\u0004\u0000\u0001\u0092\u0004\u0000\u0001\u0092\u0007\u0000\u0001{\u001a\u0000\u0001\u0093\t\u0000\u0002<\u0001\u0000\b<\u0002\u0000\u0002<\u0002\u0000\u0002<\b\u0000\u0002<\u0004\u0000\u0003<\u0001\u0000\u0001<\u0013\u0000\u0001\u0094\u0002\u0000\u0001\u0095\u0014\u0000\u0001\u0081\u0004\u0000\u0001\u0080\u0001\u0000\u0001\u0081\u0006\u0000\u0003\u0081\u0004\u0000\u0001\u0081\u0004\u0000\u0001\u0081\u0016\u0000\u0001\u0096)\u0000\u0001\u0097$\u0000\u0001\u0098\u0014\u0000\u0005\u0016\u0001G\u0003\u0000\u0002\u0016\u0002\u0000\u0002\u0016\u0002\u0000\u0006\u0016\u0001\u0099\u0001\u0016\u0002\u0000\u0004\u0016\u0003\u0000\u0001\u0016\u0003\u0000\u0005\u0016\u0001G\u0003\u0000\u0002\u0016\u0002\u0000\u0002\u0016\u0002\u0000\u0007\u0016\u0001\u009a\u0002\u0000\u0004\u0016\u0003\u0000\u0001\u0016\u0006\u0000\u0001\u008b\u0004\u0000\u0001\u008a\u0001\u0000\u0001\u008b\u0006\u0000\u0003\u008b\u0004\u0000\u0001\u008b\u0004\u0000\u0001\u008b\b\u0000\u0006+\u0003\u0000\u0002+\u0002\u0000\u0002+\u0002\u0000\b+\u0002\u0000\u0003+\u0001\u009b\u0003\u0000\u0001+\u0003\u0000\u0006+\u0003\u0000\u0002+\u0002\u0000\u0002+\u0002\u0000\u0007+\u0001\u009c\u0002\u0000\u0004+\u0003\u0000\u0001+\u0006\u0000\u0001\u0090\u0004\u0000\u0001\u008f\u0001\u0000\u0001\u0090\u0006\u0000\u0003\u0090\u0004\u0000\u0001\u0090\u0004\u0000\u0001\u0090\u000b\u0000\u0001\u0092\u0004\u0000\u0001\u0091\u0001\u0000\u0001\u0092\u0006\u0000\u0003\u0092\u0004\u0000\u0001\u0092\u0004\u0000\u0001\u0092*\u0000\u0001\u009d\u0019\u0000\u0001\u009e\"\u0000\u0001\u009f&\u0000\u0001 \u0011\u0000\u0005\u0016\u0001G\u0003\u0000\u0002\u0016\u0002\u0000\u0002\u0016\u0002\u0000\u0003\u0016\u0001¡\u0004\u0016\u0002\u0000\u0004\u0016\u0003\u0000\u0001\u0016\u0003\u0000\u0006+\u0003\u0000\u0002+\u0002\u0000\u0002+\u0002\u0000\u0001¢\u0007+\u0002\u0000\u0004+\u0003\u0000\u0001+\u0003\u0000\u0006+\u0003\u0000\u0002+\u0002\u0000\u0001£\u0001+\u0002\u0000\b+\u0002\u0000\u0004+\u0003\u0000\u0001+!\u0000\u0001¤\u0015\u0000\u0001¥+\u0000\u0001¦'\u0000\u0001§&\u0000\u0001¨&\u0000\u0001© \u0000\u0001ª)\u0000\u0001«\"\u0000\u0001©!\u0000\u0001¬-\u0000\u0001\u00ad\u000b\u0000", 0, iArr);
            return iArr;
        } catch (Throwable th) {
            if (er) {
                iy.aM(th, 863745982085160625L, null);
            }
            throw th;
        }
    }

    @ey(method = -3986889189986814048L)
    private static char[] QX(String str) {
        int i;
        try {
            if (rN) {
                iy.tp(-1043640980201421852L, null, str);
            }
            char[] cArr = new char[65536];
            int i2 = 0;
            int i3 = 0;
            while (i2 < 1392) {
                int i4 = i2 + 1;
                int iCharAt = str.charAt(i2);
                int i5 = i4 + 1;
                char cCharAt = str.charAt(i4);
                while (true) {
                    i = i3 + 1;
                    cArr[i3] = cCharAt;
                    iCharAt--;
                    if (iCharAt <= 0) {
                        break;
                    }
                    i3 = i;
                }
                i2 = i5;
                i3 = i;
            }
            return cArr;
        } catch (Throwable th) {
            if (er) {
                iy.j3(th, -1043640980201421852L, null, str);
            }
            throw th;
        }
    }

    @ey(method = -5538427534505423705L)
    private static int[] Ws() {
        try {
            if (rN) {
                iy.gn(-291941741487773895L, null);
            }
            int[] iArr = new int[173];
            J8("\t\u0000\u0001\u0001\u0003\u0000\u0006\u0001\u0001\t\u0001\u0001\u0001\u0003\u0003\u0001\u0001\t\u0001\u0003\u0003\t\u0001\u0001\u0001\u0003\u0002\u0001\u0001\t\u0003\u0001\u0001\t\u0006\u0001\u0001\t\u0005\u0001\u0003\t\u0002\u0001\u0001\t\u0005\u0001\u0001\t\u0001\u0001\u0001\u0000\u0001\u0001\u0001\u0000\u0001\t\u0004\u0000\u0002\t\u0002\u0003\u0001\u0000\u0001\u0001\u0001\u0000\u0001\t\u0003\u0000\u0001\t\u0001\u0000\u0001\t\u0002\u0001\u0001\u0000\u0001\t\u0002\u0000\u0001\u0001\u0002\u0000\u0001\u0001\u0001\u0000\u0001\u0002\u0007\u0000\u0001\t\u0001\r\u0001\u0000\u0002\u0003\u0001\r\u0001\u0001\u0004\u0000\u0002\u0001\u0005\u0000\u0001\t\u0001\u0000\u0001\r\u0001\u0005\u0001\t\u0002\u0000\u0001\t\u0002\u0000\u0001\t\u0002\u0003\u0002\t\u0001\u0000\u0001\t\u0002\u0001\u0001\t\u0001\u0000\u0001\t\u0001\u0000\u0001\t\u0002\u0000\u0001\t\u0002\u0000\u0002\u0003\u0002\u0001\u0004\u0000\u0001\u0003\u0002\u0001\u0005\u0000\u0001\r\u0002\u0000\u0002\t", 0, iArr);
            return iArr;
        } catch (Throwable th) {
            if (er) {
                iy.aM(th, -291941741487773895L, null);
            }
            throw th;
        }
    }

    @ey(method = -4195516544485786485L)
    private static int XL(String str, int i, int[] iArr) {
        try {
            if (rN) {
                iy.we(-2192809219819060023L, null, str, new Integer(i), iArr);
            }
            int i2 = 0;
            int length = str.length();
            int i3 = i;
            while (i2 < length) {
                int i4 = i2 + 1;
                int i5 = i3 + 1;
                int i6 = i4 + 1;
                iArr[i3] = (str.charAt(i2) << 16) | str.charAt(i4);
                i3 = i5;
                i2 = i6;
            }
            return i3;
        } catch (Throwable th) {
            if (er) {
                iy.U2(th, -2192809219819060023L, null, str, new Integer(i), iArr);
            }
            throw th;
        }
    }

    @ey(method = -231017916390077817L)
    private static int[] aM() {
        try {
            if (rN) {
                iy.gn(3202551040043136537L, null);
            }
            int[] iArr = new int[173];
            XL("\u0000\u0000\u0000&\u0000L\u0000r\u0000\u0098\u0000¾\u0000ä\u0000Ċ\u0000İ\u0000Ŗ\u0000ż\u0000Ƣ\u0000ǈ\u0000Ǯ\u0000Ȕ\u0000Ⱥ\u0000ɠ\u0000ʆ\u0000ʬ\u0000˒\u0000˸\u0000̞\u0000̈́\u0000ͪ\u0000ΐ\u0000˒\u0000ζ\u0000˒\u0000˒\u0000˒\u0000Ϝ\u0000Ђ\u0000Ш\u0000ю\u0000˒\u0000Ѵ\u0000Қ\u0000Ӏ\u0000˒\u0000Ӧ\u0000Ԍ\u0000Բ\u0000\u0558\u0000վ\u0000֤\u0000˒\u0000\u05ca\u0000װ\u0000ؖ\u0000ؼ\u0000٢\u0000˒\u0000˒\u0000˒\u0000ڈ\u0000ڮ\u0000˒\u0000۔\u0000ۺ\u0000ܠ\u0000݆\u0000ݬ\u0000˒\u0000ޒ\u0000\u07b8\u0000ߞ\u0000ࠄ\u0000˒\u0000ࠪ\u0000ࡐ\u0000ࡶ\u0000࢜\u0000˒\u0000˒\u0000ࣂ\u0000ࣨ\u0000ऎ\u0000ऴ\u0000ग़\u0000˒\u0000ঀ\u0000দ\u0000ৌ\u0000˒\u0000վ\u0000˒\u0000৲\u0000ਘ\u0000װ\u0000˒\u0000ؖ\u0000ਾ\u0000ڈ\u0000\u0a64\u0000ઊ\u0000ર\u0000\u0ad6\u0000ૼ\u0000ଢ\u0000ୈ\u0000୮\u0000ஔ\u0000\u0bba\u0000\u0be0\u0000ఆ\u0000˒\u0000˒\u0000బ\u0000\u0c52\u0000౸\u0000˒\u0000ಞ\u0000ೄ\u0000೪\u0000ഐ\u0000ശ\u0000൜\u0000ං\u0000ඨ\u0000\u0dce\u0000෴\u0000บ\u0000เ\u0000˒\u0000\u0e66\u0000˒\u0000ຌ\u0000˒\u0000າ\u0000໘\u0000˒\u0000\u0efe\u0000༤\u0000˒\u0000ཊ\u0000\u0f70\u0000˒\u0000˒\u0000ྖ\u0000˒\u0000ྼ\u0000\u0fe2\u0000˒\u0000ဈ\u0000˒\u0000ီ\u0000˒\u0000ၔ\u0000ၺ\u0000˒\u0000Ⴀ\u0000\u10c6\u0000წ\u0000̞\u0000ᄒ\u0000ᄸ\u0000ᅞ\u0000ᆄ\u0000ᆪ\u0000ᇐ\u0000̞\u0000\u0558\u0000\u0558\u0000ᇶ\u0000ሜ\u0000ቂ\u0000ቨ\u0000\u128e\u0000˒\u0000ኴ\u0000ዚ\u0000˒\u0000˒", 0, iArr);
            return iArr;
        } catch (Throwable th) {
            if (er) {
                iy.aM(th, 3202551040043136537L, null);
            }
            throw th;
        }
    }

    @ey(method = 1258375109264040375L)
    private static int j3(String str, int i, int[] iArr) {
        int i2;
        try {
            if (rN) {
                iy.we(499981208724954845L, null, str, new Integer(i), iArr);
            }
            int i3 = 0;
            int length = str.length();
            int i4 = i;
            while (i3 < length) {
                int i5 = i3 + 1;
                int iCharAt = str.charAt(i3);
                int i6 = i5 + 1;
                int iCharAt2 = str.charAt(i5) - 1;
                while (true) {
                    i2 = i4 + 1;
                    iArr[i4] = iCharAt2;
                    iCharAt--;
                    if (iCharAt <= 0) {
                        break;
                    }
                    i4 = i2;
                }
                i3 = i6;
                i4 = i2;
            }
            return i4;
        } catch (Throwable th) {
            if (er) {
                iy.U2(th, 499981208724954845L, null, str, new Integer(i), iArr);
            }
            throw th;
        }
    }

    @ey(method = 1604878428023816323L)
    private boolean tp() {
        try {
            if (rN) {
                iy.gn(2614921854902158937L, this);
            }
            if (this.gn > 0) {
                System.arraycopy(this.Hw, this.gn, this.Hw, 0, this.u7 - this.gn);
                this.u7 -= this.gn;
                this.VH -= this.gn;
                this.v5 -= this.gn;
                this.Zo -= this.gn;
                this.gn = 0;
            }
            if (this.VH >= this.Hw.length) {
                char[] cArr = new char[this.VH * 2];
                System.arraycopy(this.Hw, 0, cArr, 0, this.Hw.length);
                this.Hw = cArr;
            }
            int i = this.j6.read(this.Hw, this.u7, this.Hw.length - this.u7);
            if (i < 0) {
                return true;
            }
            this.u7 += i;
            return false;
        } catch (Throwable th) {
            if (er) {
                iy.aM(th, 2614921854902158937L, this);
            }
            throw th;
        }
    }

    @ey(method = -3290949079945603073L)
    private static int we(String str, int i, int[] iArr) {
        int i2;
        try {
            if (rN) {
                iy.we(-1725354124751747875L, null, str, new Integer(i), iArr);
            }
            int i3 = 0;
            int length = str.length();
            int i4 = i;
            while (i3 < length) {
                int i5 = i3 + 1;
                int iCharAt = str.charAt(i3);
                int i6 = i5 + 1;
                char cCharAt = str.charAt(i5);
                while (true) {
                    i2 = i4 + 1;
                    iArr[i4] = cCharAt;
                    iCharAt--;
                    if (iCharAt <= 0) {
                        break;
                    }
                    i4 = i2;
                }
                i3 = i6;
                i4 = i2;
            }
            return i4;
        } catch (Throwable th) {
            if (er) {
                iy.U2(th, -1725354124751747875L, null, str, new Integer(i), iArr);
            }
            throw th;
        }
    }

    @Override // com.aide.codemodel.api.Lexer
    @ey(method = -2275859416594251669L)
    public char[] DW() {
        try {
            if (rN) {
                iy.gn(-3147683087026797235L, this);
            }
            return this.Hw;
        } catch (Throwable th) {
            if (er) {
                iy.aM(th, -3147683087026797235L, this);
            }
            throw th;
        }
    }

    @Override // com.aide.codemodel.api.Lexer
    @ey(method = -268340362676363679L)
    public final char FH(int i) {
        try {
            if (rN) {
                iy.u7(374405430707494563L, this, i);
            }
            return this.Hw[this.gn + i];
        } catch (Throwable th) {
            if (er) {
                iy.j3(th, 374405430707494563L, this, new Integer(i));
            }
            throw th;
        }
    }

    @Override // com.aide.codemodel.api.Lexer
    @ey(method = 157930026095980336L)
    public final void Hw(Reader reader) {
        try {
            if (rN) {
                iy.tp(-8893707701213458288L, this, reader);
            }
            this.j6 = reader;
            this.EQ = false;
            this.gn = 0;
            this.u7 = 0;
            this.Zo = 0;
            this.v5 = 0;
            this.VH = 0;
            this.tp = 0;
            this.FH = 0;
        } catch (Throwable th) {
            if (er) {
                iy.j3(th, -8893707701213458288L, this, reader);
            }
            throw th;
        }
    }

    @Override // com.aide.codemodel.api.Lexer
    @ey(method = -3733167072152913795L)
    public int VH() {
        try {
            if (rN) {
                iy.gn(77020259794483275L, this);
            }
            return this.gn;
        } catch (Throwable th) {
            if (er) {
                iy.aM(th, 77020259794483275L, this);
            }
            throw th;
        }
    }

    @Override // com.aide.codemodel.api.Lexer
    @ey(method = -3194254933938525895L)
    public final int Zo() {
        try {
            if (rN) {
                iy.gn(-1457121183300253053L, this);
            }
            return this.v5 - this.gn;
        } catch (Throwable th) {
            if (er) {
                iy.aM(th, -1457121183300253053L, this);
            }
            throw th;
        }
    }

    @ey(method = 1105138643302395455L)
    public void gn(boolean z) {
        try {
            if (rN) {
                iy.Ws(-1142788549339605883L, this, z);
            }
            this.we = z;
        } catch (Throwable th) {
            if (er) {
                iy.j3(th, -1142788549339605883L, this, new Boolean(z));
            }
            throw th;
        }
    }

    @Override // com.aide.codemodel.api.Lexer
    @ey(method = -2873970020903135009L)
    public int j6() {
        try {
            if (rN) {
                iy.gn(2675214436389478557L, this);
            }
            return this.tp;
        } catch (Throwable th) {
            if (er) {
                iy.aM(th, 2675214436389478557L, this);
            }
            throw th;
        }
    }

    @ey(method = -456112468093364805L)
    public final void u7(int i) {
        try {
            if (rN) {
                iy.u7(79530655604201093L, this, i);
            }
            this.FH = i;
        } catch (Throwable th) {
            if (er) {
                iy.j3(th, 79530655604201093L, this, new Integer(i));
            }
            throw th;
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:13:0x0042, code lost:
    
        r11 = 65535;
     */
    @Override // com.aide.codemodel.api.Lexer
    @abcd.ey(method = 1156581754943315876L)
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public int v5() {
        /*
            Method dump skipped, instructions count: 888
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: com.aide.codemodel.language.xml.XmlLexer.v5():int");
    }
}
